# Задача 6: Вы пользуетесь общественным транспортом?
# Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.

number = int(input("Введите номер билета: "))
sum1 = 0
sum2 = 0
#100000
if number > 99999 and number < 1000000:
    while number > 1000:
        lastDigit1 = number % 10
        sum1 = sum1 + lastDigit1
        number = number // 10
    while number != 0:
        lastDigit2 = number % 10
        sum2 = sum2 + lastDigit2
        number = number // 10
    if sum1 == sum2:
        print("Поздравляем, ваш билет счастливый!")
    else:
        print("Увы, ваш билет не счастливый")
else:
    print("Ошибка: ввести нужно шестизначное число")