# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно,
# что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

s = int(input("Введите общее количество журавликов: "))

x = int(s / 6) # s=x+x+2(x+x)

print(f"Петя и сережа сделали по {x} журавликов")
print(f"Катя сделала {4 * x} журавликов")
